<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-pandas-and-load-the-stacked-and-melted-nls-data" data-toc-modified-id="Import-pandas-and-load-the-stacked-and-melted-nls-data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas and load the stacked and melted nls data</a></span></li><li><span><a href="#View-the-stacked-weeks-worked-data" data-toc-modified-id="View-the-stacked-weeks-worked-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>View the stacked weeks worked data</a></span></li><li><span><a href="#Use-stack-to-convert-from-long-to-wide" data-toc-modified-id="Use-stack-to-convert-from-long-to-wide-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Use stack to convert from long to wide</a></span></li><li><span><a href="#Use-pivot-to-convert-from-long-to-wide" data-toc-modified-id="Use-pivot-to-convert-from-long-to-wide-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Use pivot to convert from long to wide</a></span></li></ul></div>

# Import pandas and load the stacked and melted nls data

In [1]:
import pandas as pd

In [2]:
pd.set_option('display.width', 200)
pd.set_option('display.max_columns', 30)
pd.set_option('display.max_rows', 200)
pd.options.display.float_format = '{:,.0f}'.format

In [3]:
import watermark
%load_ext watermark

%watermark -n -i -iv

watermark: 2.1.0
json     : 2.0.9
pandas   : 1.2.1

In [4]:
weeksworkedstacked = pd.read_pickle('data/nlsweeksworkedstacked.pkl')
workschoolmelted = pd.read_pickle('data/nlsworkschoolmelted.pkl')

# View the stacked weeks worked data

In [5]:
weeksworkedstacked.head(10)

originalid
8245        weeksworked00   46
            weeksworked01   52
            weeksworked02   52
            weeksworked04   52
            weeksworked05   53
3962        weeksworked00    5
            weeksworked01   49
            weeksworked02   52
            weeksworked04   52
            weeksworked05   53
dtype: float64

In [6]:
weeksworkedstacked.index

MultiIndex([(8245, 'weeksworked00'),
            (8245, 'weeksworked01'),
            (8245, 'weeksworked02'),
            (8245, 'weeksworked04'),
            (8245, 'weeksworked05'),
            (3962, 'weeksworked00'),
            (3962, 'weeksworked01'),
            (3962, 'weeksworked02'),
            (3962, 'weeksworked04'),
            (3962, 'weeksworked05'),
            ...
            (7815, 'weeksworked00'),
            (7815, 'weeksworked01'),
            (7815, 'weeksworked02'),
            (7815, 'weeksworked04'),
            (7815, 'weeksworked05'),
            ( 166, 'weeksworked00'),
            ( 166, 'weeksworked01'),
            ( 166, 'weeksworked02'),
            ( 166, 'weeksworked04'),
            ( 166, 'weeksworked05')],
           names=['originalid', None], length=44920)

# Use stack to convert from long to wide

In [7]:
weeksworked = weeksworkedstacked.unstack()
weeksworked.head(10)

            weeksworked00  weeksworked01  weeksworked02  weeksworked04  weeksworked05
originalid
8245                   46             52             52             52             53
3962                    5             49             52             52             53
3571                    5              8             52             40             41
2979                   29             34             52             52             53
8511                   53             52             52             48             53
5191                   51             44             52             48             53
7593                   49             43             51             39             53
5512                   49             52             52             35             44
6668                   53             49             49             52             53
4809                    0              0              0              0              0

# Use pivot to convert from long to wide

In [8]:
workschoolmelted.loc[workschoolmelted['originalid'].isin([1,2])].sort_values(['originalid','year'])

       originalid  year  weeksworked           colenroct
377             1  2000           53   3. 4-year college
9361            1  2001           52   3. 4-year college
18345           1  2002          NaN   3. 4-year college
27329           1  2003           42     1. Not enrolled
36313           1  2004           52     1. Not enrolled
8980            2  2000           51   3. 4-year college
17964           2  2001           52  2. 2-year college
26948           2  2002           44   3. 4-year college
35932           2  2003           45   3. 4-year college
44916           2  2004           52   3. 4-year college

In [9]:
workschool = workschoolmelted.pivot(index='originalid', columns='year', values=['weeksworked','colenroct']).reset_index()

In [10]:
workschool.columns = workschool.columns.map('{0[0]}{0[1]}'.format)

In [11]:
workschool.loc[workschool.originalid.isin([1,2])].T

                                 0                   1
originalid                       1                   2
weeksworked2000                 53                  51
weeksworked2001                 52                  52
weeksworked2002                NaN                  44
weeksworked2003                 42                  45
weeksworked2004                 52                  52
colenroct2000    3. 4-year college   3. 4-year college
colenroct2001    3. 4-year college  2. 2-year college
colenroct2002    3. 4-year college   3. 4-year college
colenroct2003      1. Not enrolled   3. 4-year college
colenroct2004      1. Not enrolled   3. 4-year college